<?php
/*
 * 所有数据库方法接口类
 */
namespace fijdemon\fijsql\behavior\sql;

/**
 * 数据库方法接口
 +--------------------------------------------------
 * @author fijdemon
 * @createTime 2015年02月07日(星期六)
 +--------------------------------------------------
 */
interface SqlInterface
{
    /**
     * 数据库处理最基本的操作
     +--------------------------------------------------
     * @param string $sqlStr
     * @access public
     +--------------------------------------------------
     */
    public function query($sqlStr);
    
    
    /**
     * 增加 如果有参数，优先
     +--------------------------------------------------
     * @param array $data
     * @access public
     +--------------------------------------------------
     */
    public function insert(Array $data);
    
    
    /**
     * 查找
     +--------------------------------------------------
     * @access public
     +--------------------------------------------------
     */
    public function select();
    
    
    /**
     * 更新（切记不要没有主键更新啊）
     +--------------------------------------------------
     * @access public
     +--------------------------------------------------
     */
    public function update();
    
    
    /**
     * 删除（切记不要没有主键删除啊）
     +--------------------------------------------------
     * @access public
     +--------------------------------------------------
     */
    public function delete();
    
    
    /**
     * 多条插入
     +--------------------------------------------------
     * @access pulbic
     * @param array $data
     +--------------------------------------------------
     */
    public function insertAll(Array $data);
    
    
    /**
     * select 模式为  select后面的字段选项
     * insert 模式为  字段列表
     +--------------------------------------------------
     * @param <string|array> $field
     +--------------------------------------------------
     */
    public function field($field);
    
    
    /**
     * 选择要执行的数据库
     +--------------------------------------------------
     * @param string $table
     +--------------------------------------------------
     */
    public function table($table);
    
    
    /**
     * 条件（直接写条件，或者用算术符号树还标示）
     +--------------------------------------------------
     * @param <string|array> $where
     * ((name='张三') OR (name='李四')) AND ((age<30) AND (age>20))
     * array(
     *      'and' => array(
     *          'or'=>array("name='张三'","name='李四'"),
     *          'and'=>array("age<30","age>20"),
     * )
     +--------------------------------------------------
     */
    public function where($where);
    
    
    /**
     * goup by
     +--------------------------------------------------
     * @param string $group 字段
     +--------------------------------------------------
     */
    public function group($group);
    
    
    /**
     * group条件（直接写条件，或者用算术符号树还标示）
     +--------------------------------------------------
     * @param <string|array> $where
     * ((name='张三') OR (name='李四')) AND ((age<30) AND (age>20))
     * array(
     *      'and' => array(
     *          'or'=>array("name='张三'","name='李四'"),
     *          'and'=>array("age<30","age>20"),
     * )
     +--------------------------------------------------
     */
    public function having($having);
    
    
    /**
     * 限制个数
     * $limit 为字符串              直接替换 忽略第二个参数
     * $limit 为数字
     *      $length 为空       0     , $limit
     *      $length int   $limit,$length
     +--------------------------------------------------
     * @param <string|int> $limit 
     * @param int $length
     +--------------------------------------------------
     */
    public function limit($limit, $length=null);
    
    
    /**
     * 排序
     +--------------------------------------------------
     * @param string $order
     +--------------------------------------------------
     */
    public function order($order);
    
    
    /**
     * update 模式设置值（切记，不要没有主键更新）
     +--------------------------------------------------
     * @param <string|array> $data
     +--------------------------------------------------
     */
    public function set($data);
}

?>